nc: 80 
  
scales:
  a: [1.00, 0.25, 1024]

backbone:
  - [-1, 1, Patchify, [128,  4]] 
  - [-1, 2, GELAN_InceptionNeXt, [128,  1, 4]]
  - [-1, 1, Patchify, [256,  2]] 
  - [-1, 2, GELAN_InceptionNeXt, [256,  2, 4]]
  - [-1, 1, Patchify, [512,  2]]
  - [-1, 2, GELAN_InceptionNeXt, [512,  2, 4]]
  - [-1, 1, Patchify, [1024, 2]] 
  - [-1, 2, GELAN_InceptionNeXt, [1024, 1, 3]]

head:
  - [-1, 1, Classify, [nc]] # Classify
