# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-cls image classification model. For Usage examples see https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 1000 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [1, 0.25, 1024]

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Patchify, [128,  4]] 
  - [-1, 2, GELAN_MetaNeXt_Ident, [128,  1, 4]]
  - [-1, 1, Patchify, [256,  2]] 
  - [-1, 2, GELAN_MetaNeXt_Ident, [256,  2, 4]]
  - [-1, 1, Patchify, [512,  2]]
  - [-1, 2, GELAN_MetaNeXt_Ident, [512,  2, 4]]
  - [-1, 1, Patchify, [1024, 2]] 
  - [-1, 2, GELAN_MetaNeXt_Ident, [1024, 1, 3]]
# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]] # Classify
