
nc: 1000 
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024] 
  l: [1.00, 1.00, 1024] 
  x: [1.00, 1.25, 1024] 

cuda_forced: True # FIXME nn/tasks.py/DetectionModel.__init__()

backbone:
  # [from, repeats, module, args]
  - [-1, 1, CNA, [64,   3, 2, None, 1, 1, nn.GELU, SwitchNorm2d]]       # 0-P1/2
  - [-1, 1, CNA, [128,  3, 2, None, 1, 1, nn.GELU, SwitchNorm2d]]       # 1-P2/4
  - [-1, 3, GELAN_DCNv4, [128 , 2, None, True, nn.GELU, SwitchNorm2d]]
  - [-1, 1, AvgDownsample, [256,  nn.GELU, SwitchNorm2d]]               # 3-P3/8
  - [-1, 6, GELAN_DCNv4, [256 , 2, None, True, nn.GELU, SwitchNorm2d]]
  - [-1, 1, AvgDownsample, [512,  nn.GELU, SwitchNorm2d]]               # 5-P4/16
  - [-1, 6, GELAN_DCNv4, [512 , 2, None, True, nn.GELU, SwitchNorm2d]]
  - [-1, 1, AvgDownsample, [1024, nn.GELU, SwitchNorm2d]]               # 7-P5/32
  - [-1, 3, GELAN_DCNv4, [1024, 2, None, True, nn.GELU, SwitchNorm2d]]
  - [-1, 1, SPPF, [1024, 5]]                                            # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]                                           
  - [-1, 3, GELAN_DCNv4, [512, 2, None, True, nn.GELU, SwitchNorm2d]]   # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 3, GELAN_DCNv4, [256, 2, None, True, nn.GELU, SwitchNorm2d]]   # 15

  - [-1, 1, CNA, [256, 3, 2, None, 1, 1, nn.GELU, SwitchNorm2d]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, GELAN_DCNv4, [512, 2, None, True, nn.GELU, SwitchNorm2d]]   # 18

  - [-1, 1, CNA, [512, 3, 2, None, 1, 1, nn.GELU, SwitchNorm2d]]
  - [[-1, 9], 1, Concat, [1]] 
  - [-1, 3, GELAN_DCNv4, [1024, 2, None, True, nn.GELU, SwitchNorm2d]]  # 21

  - [[15, 18, 21], 1, Detect, [nc]] 
