
nc: 1000 # number of classes
backbone:
  - [-1, 1, Patchify, [96,  4, True]] 
  - [-1, 3, ConvNeXtStage, [96]]
  - [-1, 1, Patchify, [192, 2]] 
  - [-1, 6, ConvNeXtStage, [192]]
  - [-1, 1, Patchify, [384, 2]]
  - [-1, 6, ConvNeXtStage, [384]]
  - [-1, 1, Patchify, [768, 2]] 
  - [-1, 3, ConvNeXtStage, [768]]
# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]] # Classify
