
nc: 1000 # number of classes
backbone:
  - [-1, 1, Patchify, [96,  4, True]] 
  - [-1, 3, InceptionNeXtStage, [96, 4]]
  - [-1, 1, Patchify, [192, 2]] 
  - [-1, 3, InceptionNeXtStage, [192, 4]]
  - [-1, 1, Patchify, [384, 2]]
  - [-1, 9, InceptionNeXtStage, [384, 4]]
  - [-1, 1, Patchify, [768, 2]] 
  - [-1, 3, InceptionNeXtStage, [768, 3]]
# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]] # Classify
