# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-cls image classification model. For Usage examples see https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 1000 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# Using stock Downsample.
# ConvNeXt Stage using FakeLayerNorm, 

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, ConvNeXtStage, [128, nn.GELU, LayerNorm2d]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, ConvNeXtStage, [256, nn.GELU, LayerNorm2d]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, ConvNeXtStage, [512, nn.GELU, LayerNorm2d]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, ConvNeXtStage, [1024, nn.GELU, LayerNorm2d]]

# YOLOv8.0n head
head:
  - [-1, 1, ClassificationHead, [nc]] # Classify
