
nc: 80

backbone:
  - [-1, 1, Patchify, [32,  4, True]] 
  - [-1, 3, ConvNeXtStage, [32]]
  - [-1, 1, Patchify, [64, 2]] 
  - [-1, 6, ConvNeXtStage, [64]]
  - [-1, 1, Patchify, [128, 2]]
  - [-1, 6, ConvNeXtStage, [128]]
  - [-1, 1, Patchify, [256, 2]] 
  - [-1, 3, ConvNeXtStage, [256]]
# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]] # Classify
