nc: 80 
  

scales:
  n: [1.00, 1.50, 99999]

backbone:
  - [-1, 1, Patchify, [32,  4, True]] 
  - [-1, 3, GELAN_ConvNeXt, [32,  1]]
  - [-1, 1, Patchify, [64,  2]] 
  - [-1, 3, GELAN_ConvNeXt, [64,  2]]
  - [-1, 1, Patchify, [128,  2]]
  - [-1, 3, GELAN_ConvNeXt, [128, 2]]
  - [-1, 1, Patchify, [256, 2]] 
  - [-1, 3, GELAN_ConvNeXt, [256, 1]]

head:
  - [-1, 1, Classify, [nc]] # Classify
