
nc: 80
backbone:
  - [-1, 1, Patchify, [32,  4, True]] 
  - [-1, 3, InceptionNeXtStage, [32, 4]]
  - [-1, 1, Patchify, [64, 2]] 
  - [-1, 6, InceptionNeXtStage, [64, 4]]
  - [-1, 1, Patchify, [128, 2]]
  - [-1, 6, InceptionNeXtStage, [128, 4]]
  - [-1, 1, Patchify, [256, 2]] 
  - [-1, 3, InceptionNeXtStage, [256, 3]]
# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]] # Classify
