# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-cls image classification model. For Usage examples see https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 1000 # number of classes
scales: 
  n: [0.33, 0.25, 1024]


# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Patchify, [128,   4, False]] # 0-P1/2
  - [-1, 3, ConvNeXtStage, [128]]
  - [-1, 1, Patchify, [256,  2]] # 3-P3/8
  - [-1, 6, ConvNeXtStage, [256]]
  - [-1, 1, Patchify, [512,  2]] # 5-P4/16
  - [-1, 6, ConvNeXtStage, [512]]
  - [-1, 1, Patchify, [1024, 2]] # 7-P5/32
  - [-1, 3, ConvNeXtStage, [1024]]

# YOLOv8.0n head
head:
  - [-1, 1, ClassificationHead, [nc]] # Classify
