# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-cls image classification model. For Usage examples see https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 1000 # number of classes

# Full stock ConvNeXt-T, Own implement.

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Patchify, [96,   4, False]] # 0-P1/2
  - [-1, 3, ConvNeXtStage, [96]]
  - [-1, 1, Patchify, [192,  2]] # 3-P3/8
  - [-1, 3, ConvNeXtStage, [192]]
  - [-1, 1, Patchify, [384,  2]] # 5-P4/16
  - [-1, 9, ConvNeXtStage, [384]]
  - [-1, 1, Patchify, [768, 2]] # 7-P5/32
  - [-1, 3, ConvNeXtStage, [768]]

# YOLOv8.0n head
head:
  - [-1, 1, ClassificationHead, [nc]] # Classify
