
nc: 1000
scales: 
  n: [0.33, 0.25, 1024]

# Using my own implement (GLEAN + DarknetBottleneck)
# Using GELU and FakeLayerNorm.

backbone:
  # [from, repeats, module, args]
  - [-1, 1, CNA, [64, 3, 2]] # 0-P1/2
  - [-1, 1, CNA, [128, 3, 2]] # 1-P2/4
  - [-1, 3, ELAN_DarknetBottleneck, [128,  1, True, 0.5, nn.GELU, FakeLayerNorm2d]]
  - [-1, 1, CNA, [256, 3, 2]] # 3-P3/8
  - [-1, 6, ELAN_DarknetBottleneck, [256,  1, True, 0.5, nn.GELU, FakeLayerNorm2d]]
  - [-1, 1, CNA, [512, 3, 2]] # 5-P4/16
  - [-1, 6, ELAN_DarknetBottleneck, [512,  1, True, 0.5, nn.GELU, FakeLayerNorm2d]]
  - [-1, 1, CNA, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, ELAN_DarknetBottleneck, [1024, 1, True, 0.5, nn.GELU, FakeLayerNorm2d]]

# YOLOv8.0n head
head:
  - [-1, 1, ClassificationHead, [nc]] # Classify
