# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-cls image classification model. For Usage examples see https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 1000 # number of classes
scales: 
  n: [0.33, 0.25, 1024]

# Almost Stock ConvNeXt architecture except Depth and Width.
# ConvNeXt Stage using FakeLayerNorm, 

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Patchify, [128,   4, False, LayerNorm2d]] # 0-P1/2
  - [-1, 3, ConvNeXtStage, [128, nn.GELU, LayerNorm2d]]
  - [-1, 1, Patchify, [256,  2, True, LayerNorm2d]] # 3-P3/8
  - [-1, 6, ConvNeXtStage, [256, nn.GELU, LayerNorm2d]]
  - [-1, 1, Patchify, [512,  2, True, LayerNorm2d]] # 5-P4/16
  - [-1, 6, ConvNeXtStage, [512, nn.GELU, LayerNorm2d]]
  - [-1, 1, Patchify, [1024, 2, True, LayerNorm2d]] # 7-P5/32
  - [-1, 3, ConvNeXtStage, [1024, nn.GELU, LayerNorm2d]]

# YOLOv8.0n head
head:
  - [-1, 1, ClassificationHead, [nc]] # Classify
