
nc: 80
backbone:
  - [-1, 1, Patchify, [32,  4, False]] 
  - [-1, 3, ConvNeXtStage, [32, nn.GELU, FakeLayerNorm2d]]
  - [-1, 1, Patchify, [64, 2]] 
  - [-1, 3, ConvNeXtStage, [64, nn.GELU, FakeLayerNorm2d]]
  - [-1, 1, Patchify, [128, 2]]
  - [-1, 9, ConvNeXtStage, [128, nn.GELU, FakeLayerNorm2d]]
  - [-1, 1, Patchify, [256, 2]] 
  - [-1, 3, ConvNeXtStage, [256, nn.GELU, FakeLayerNorm2d]]
# YOLOv8.0n head
head:
  - [-1, 1, ClassificationHead, [nc]] # Classify
