
nc: 80
backbone:
  - [-1, 1, Patchify, [32,  4, False]] 
  - [-1, 2, ELAN_DarknetBottleneck, [32, 1, False, 0.5, nn.GELU, FakeLayerNorm2d]]
  - [-1, 1, Patchify, [64,  2]] 
  - [-1, 2, ELAN_DarknetBottleneck, [64, 1, False, 0.5, nn.GELU, FakeLayerNorm2d]]
  - [-1, 1, Patchify, [128,  2]] 
  - [-1, 2, ELAN_DarknetBottleneck, [128, 1, False, 0.5, nn.GELU, FakeLayerNorm2d]]
  - [-1, 1, Patchify, [256,  2]] 
  - [-1, 2, ELAN_DarknetBottleneck, [256, 1, False, 0.5, nn.GELU, FakeLayerNorm2d]]
# YOLOv8.0n head
head:
  - [-1, 1, ClassificationHead, [nc]] # Classify
